#+title: German
#+author: Arumoy Shome
#+date: [2022-08-26 Fri]
#+property: header-args:python :python python3 :session *sh21qual-german* :exports both :eval never-export

In this document we analyse the results for the german dataset. The
dataset contains 2 protected attributes: sex & age.

* Analysis of protected attribute =sex=

Males are considered privileged in this protected attribute.

#+begin_src python
  data = german[german['protected'] == 'sex']
  data.shape
#+end_src

#+RESULTS:
| 15 | 22 |

#+begin_src python :exports none
  data
#+end_src

#+RESULTS:
#+begin_example
       TN       FPR        f1 dataset  disparate_impact       FNR       PPV  \
75    NaN       NaN       NaN  german          0.896567       NaN       NaN   
76    NaN       NaN       NaN  german               NaN       NaN       NaN   
77    NaN       NaN       NaN  german               NaN       NaN       NaN   
81    NaN       NaN       NaN  german          0.865281       NaN       NaN   
82    NaN       NaN       NaN  german               NaN       NaN       NaN   
83    NaN       NaN       NaN  german               NaN       NaN       NaN   
87    NaN       NaN       NaN  german          0.984127       NaN       NaN   
88    NaN       NaN       NaN  german               NaN       NaN       NaN   
89    NaN       NaN       NaN  german               NaN       NaN       NaN   
93   37.0  0.513158  0.813370  german          0.791667  0.160920  0.789189   
94   17.0  0.645833  0.808333  german               NaN  0.133929  0.757812   
95   20.0  0.285714  0.823529  german               NaN  0.209677  0.859649   
99   40.0  0.473684  0.796562  german          1.000000  0.201149  0.794286   
100  25.0  0.479167  0.794643  german               NaN  0.205357  0.794643   
101  15.0  0.464286  0.800000  german               NaN  0.193548  0.793651   

    privileged  accuracy       TPR  base_rate  num_positives    FP     TP  \
75        None       NaN       NaN   0.700000          700.0   NaN    NaN   
76        True       NaN       NaN   0.723188          499.0   NaN    NaN   
77       False       NaN       NaN   0.648387          201.0   NaN    NaN   
81        None       NaN       NaN   0.701333          526.0   NaN    NaN   
82        True       NaN       NaN   0.730189          387.0   NaN    NaN   
83       False       NaN       NaN   0.631818          139.0   NaN    NaN   
87        None       NaN       NaN   0.696000          174.0   NaN    NaN   
88        True       NaN       NaN   0.700000          112.0   NaN    NaN   
89       False       NaN       NaN   0.688889           62.0   NaN    NaN   
93        None  0.732000  0.839080        NaN            NaN  39.0  146.0   
94        True  0.712500  0.866071        NaN            NaN  31.0   97.0   
95       False  0.766667  0.790323        NaN            NaN   8.0   49.0   
99        None  0.716000  0.798851        NaN            NaN  36.0  139.0   
100       True  0.712500  0.794643        NaN            NaN  23.0   89.0   
101      False  0.722222  0.806452        NaN            NaN  13.0   50.0   

    subset protected  statistical_parity_difference  num_negatives  \
75    full       sex                      -0.074801          300.0   
76    full       sex                            NaN          191.0   
77    full       sex                            NaN          109.0   
81   train       sex                      -0.098370          224.0   
82   train       sex                            NaN          143.0   
83   train       sex                            NaN           81.0   
87    test       sex                      -0.011111           76.0   
88    test       sex                            NaN           48.0   
89    test       sex                            NaN           28.0   
93    test       sex                      -0.166667            NaN   
94    test       sex                            NaN            NaN   
95    test       sex                            NaN            NaN   
99    test       sex                       0.000000            NaN   
100   test       sex                            NaN            NaN   
101   test       sex                            NaN            NaN   

                      model       TNR    FN  theil_index  
75                     None       NaN   NaN          NaN  
76                     None       NaN   NaN          NaN  
77                     None       NaN   NaN          NaN  
81                     None       NaN   NaN          NaN  
82                     None       NaN   NaN          NaN  
83                     None       NaN   NaN          NaN  
87                     None       NaN   NaN          NaN  
88                     None       NaN   NaN          NaN  
89                     None       NaN   NaN          NaN  
93       logisticregression  0.486842  28.0     0.164088  
94       logisticregression  0.354167  15.0          NaN  
95       logisticregression  0.714286  13.0          NaN  
99   decisiontreeclassifier  0.526316  35.0     0.194839  
100  decisiontreeclassifier  0.520833  23.0          NaN  
101  decisiontreeclassifier  0.535714  12.0          NaN  
#+end_example

* Analysis of protected attribute =age=

#+begin_src python
  data = german[german['protected'] == 'age']
  data.shape
#+end_src

#+RESULTS:
| 15 | 22 |

#+begin_src python :exports none
  data
#+end_src

#+RESULTS:
#+begin_example
       TN       FPR        f1 dataset  disparate_impact       FNR       PPV  \
78    NaN       NaN       NaN  german          0.794826       NaN       NaN   
79    NaN       NaN       NaN  german               NaN       NaN       NaN   
80    NaN       NaN       NaN  german               NaN       NaN       NaN   
84    NaN       NaN       NaN  german          0.807230       NaN       NaN   
85    NaN       NaN       NaN  german               NaN       NaN       NaN   
86    NaN       NaN       NaN  german               NaN       NaN       NaN   
90    NaN       NaN       NaN  german          0.761538       NaN       NaN   
91    NaN       NaN       NaN  german               NaN       NaN       NaN   
92    NaN       NaN       NaN  german               NaN       NaN       NaN   
96   37.0  0.513158  0.813370  german          0.857361  0.160920  0.789189   
97   25.0  0.528302  0.831081  german               NaN  0.151724  0.814570   
98   12.0  0.478261  0.730159  german               NaN  0.206897  0.676471   
102  40.0  0.473684  0.796562  german          0.884886  0.201149  0.794286   
103  29.0  0.452830  0.822300  german               NaN  0.186207  0.830986   
104  11.0  0.521739  0.677419  german               NaN  0.275862  0.636364   

    privileged  accuracy       TPR  base_rate  num_positives    FP     TP  \
78        None       NaN       NaN   0.700000          700.0   NaN    NaN   
79        True       NaN       NaN   0.728395          590.0   NaN    NaN   
80       False       NaN       NaN   0.578947          110.0   NaN    NaN   
84        None       NaN       NaN   0.701333          526.0   NaN    NaN   
85        True       NaN       NaN   0.727124          445.0   NaN    NaN   
86       False       NaN       NaN   0.586957           81.0   NaN    NaN   
90        None       NaN       NaN   0.696000          174.0   NaN    NaN   
91        True       NaN       NaN   0.732323          145.0   NaN    NaN   
92       False       NaN       NaN   0.557692           29.0   NaN    NaN   
96        None  0.732000  0.839080        NaN            NaN  39.0  146.0   
97        True  0.747475  0.848276        NaN            NaN  28.0  123.0   
98       False  0.673077  0.793103        NaN            NaN  11.0   23.0   
102       None  0.716000  0.798851        NaN            NaN  36.0  139.0   
103       True  0.742424  0.813793        NaN            NaN  24.0  118.0   
104      False  0.615385  0.724138        NaN            NaN  12.0   21.0   

    subset protected  statistical_parity_difference  num_negatives  \
78    full       age                      -0.149448          300.0   
79    full       age                            NaN          220.0   
80    full       age                            NaN           80.0   
84   train       age                      -0.140168          224.0   
85   train       age                            NaN          167.0   
86   train       age                            NaN           57.0   
90    test       age                      -0.174631           76.0   
91    test       age                            NaN           53.0   
92    test       age                            NaN           23.0   
96    test       age                      -0.108780            NaN   
97    test       age                            NaN            NaN   
98    test       age                            NaN            NaN   
102   test       age                      -0.082556            NaN   
103   test       age                            NaN            NaN   
104   test       age                            NaN            NaN   

                      model       TNR    FN  theil_index  
78                     None       NaN   NaN          NaN  
79                     None       NaN   NaN          NaN  
80                     None       NaN   NaN          NaN  
84                     None       NaN   NaN          NaN  
85                     None       NaN   NaN          NaN  
86                     None       NaN   NaN          NaN  
90                     None       NaN   NaN          NaN  
91                     None       NaN   NaN          NaN  
92                     None       NaN   NaN          NaN  
96       logisticregression  0.486842  28.0     0.164088  
97       logisticregression  0.471698  22.0          NaN  
98       logisticregression  0.521739   6.0          NaN  
102  decisiontreeclassifier  0.526316  35.0     0.194839  
103  decisiontreeclassifier  0.547170  27.0          NaN  
104  decisiontreeclassifier  0.478261   8.0          NaN  
#+end_example

